Revit 2024 API
AnalysisDisplayDeformedShapeSettings Class
 Contains deformed shape settings for analysis display style element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class AnalysisDisplayDeformedShapeSettings : IDisposable
Visual Basic
Public Class AnalysisDisplayDeformedShapeSettings _
	Implements IDisposable
Visual C++
public ref class AnalysisDisplayDeformedShapeSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings
See Also
AnalysisDisplayDeformedShapeSettings Members
Autodesk.Revit.DB.Analysis Namespace